---
kind: type
id: T:Autodesk.Revit.DB.LinkLoadResultType
source: html/11b095e1-24d9-91b9-ae2e-004f67c94d6e.htm
---
# Autodesk.Revit.DB.LinkLoadResultType

Enum listing the possible results after loading a linked model.

## Syntax (C#)
```csharp
public enum LinkLoadResultType
```

## Remarks
For all values except LinkLoadResultType.LinkLoaded, the linked model
 is not loaded and no new link is created (if Revit was trying to create a link).